## ./m

```
entering
[m.c:create_room:104:init] 0x9447010 (1)
OK
vroom->b: 1
closed?
ch->a: 10
p 0x9447008 p_ref:  0x9447010
there are 1 keys in the hash.
FOUND! 0x9447008
result->a: 10
OK
vroom->b: 1
closed?
on_remove occured.0x9447008
data:0x9447008 10
[m.c:on_remove:125: decrease] 0x9447010 (0)
boo 0x9447008
 p (nil)
the value 'dummy_key' was  found and removed
there are 0 keys in the hash.
end 2 p 0x9447008
bye!***

```